Revit 2024 API
StructuralSectionHotRolled Class
 Defines parameters for hot rolled structural sections.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public class StructuralSectionHotRolled : StructuralSectionRectangular
Visual Basic
Public Class StructuralSectionHotRolled _
	Inherits StructuralSectionRectangular
Visual C++
public ref class StructuralSectionHotRolled : public StructuralSectionRectangular
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRectangular
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionHotRolled
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralI
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralT
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralU
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralW
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionIWideFlange
See Also
StructuralSectionHotRolled Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace